Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv1d (Conv1D)             (None, 2498, 32)          224       
                                                                 
 max_pooling1d (MaxPooling1D  (None, 1249, 32)         0         
 )                                                               
                                                                 
 conv1d_1 (Conv1D)           (None, 1247, 64)          6208      
                                                                 
 max_pooling1d_1 (MaxPooling  (None, 623, 64)          0         
 1D)                                                             
                                                                 
 flatten (Flatten)           (None, 39872)             0         
                                                                 
 dense (Dense)               (None, 128)               5103744   
                                                                 
 dense_1 (Dense)             (None, 55)                7095      
                                                                 
=================================================================
Total params: 5,117,271
Trainable params: 5,117,271
Non-trainable params: 0
_________________________________________________________________
